<template style="width: 100%" >
  <div style="width: 100%" >
    <el-table :data="sample_data" style="width: 100%" >
      <el-table-column prop="university" label="学校" header-align="center" align='center' width='200'></el-table-column>
      <el-table-column prop="score" label="分数" header-align="center" align='center' width='100'></el-table-column>

      <el-table-column label="关键词" header-align="center" align='center' width='400'>
          <div slot-scope="scope" class="contents">
          {{sample_data[scope.$index].words.toString()}}
        </div>
      </el-table-column>
         <el-table-column label="全文" header-align="center" align='center' min-width='400'>
          <div slot-scope="scope" class="contents">
          {{sample_data[scope.$index].content}}
        </div>
      </el-table-column>

      <el-table-column label="操作" header-align="center" align='center' width='200'>
        <template slot-scope="scope">
          <el-button @click="handleShow(scope.row, scope.$index)" type="text">查看详情</el-button>
        </template>
      </el-table-column>
    </el-table>
    <el-dialog title="详细信息" :visible.sync="dialogVisible" width="50%">
      <div class="details">
        <b>学校：</b>
        {{message.university}}
      </div>
      <div class="details"><b>分数：</b>{{message.score}}</div>
      <div class="details"><b>关键词：</b>{{words.toString()}}</div>
      <div class="details"><b>全文：</b>{{message.content}}</div>
      <span slot="footer" class="dialog-footer">
        <el-button type="primary" @click="dialogVisible = false">关 闭</el-button>
      </span>
    </el-dialog>
  </div>
</template>



<style>
.el-header {
  background-color: #b3c0d1;
  color: #333;
  line-height: 60px;
  font-size: 25px;
}

.el-aside {
  color: #333;
}
.details {
  text-align: left;
}
.contents{
    overflow:hidden; 
    text-overflow:ellipsis;
    white-space:nowrap;
    width:100%; 
}
</style>

<script>
export default {
  data() {
    return {
      dialogVisible: false,
      sample_data: Array(10).fill({
        score: 88.88,
        words: ["社会主义", "建设", "通过", "时代","社会主义", "建设", "通过", "时代","社会主义", "建设", "通过", "时代","社会主义", "建设", "通过", "时代"],
        university: "哈尔滨工业大学",
        content:
          "一、北大深入学习宣传贯彻落实党的十九大精 神。10月18-24日，中共十九大召开，北大党委书记郝平当选中央候补委员。北大举办了“十九大与社会主义现代化国家”理论研讨会等活动，学习贯彻十九 大精神。中央宣讲团进入北大宣讲，北大教师、博士生参与教育部、北京市的十 九大宣讲团深入基层宣传十九大精神。“十九大与社会主义现代化国家”理论研 讨会现场北大党委书记郝平当选为中国共产党第十九届中央委员会候补委员北京 大学召开“十九大与社会主义现代化国家”理论研讨会?中央宣讲团赴京大学宣讲 党的十九大精神?二、北大成功召开第十三次党代会。第十三次党代会于11月 18-19日召开，选举产生了中共北京大学第十三届委员会和中共北京大学第十三 届纪律检查委员会，通过了关于中共北京大学第十二届委员会工作报告的决议。 第十三次党代会开启了北大新时代建设中国特色世界一流大学的新征程。此前， 北大医学部于11月3日召开第十三次党代会。北京大学第十三次党代会开幕会现 场中国共产党北京大学第十三次党员代表大会开幕中国共产党北京大学第十三次 党员代表大会胜利闭幕中国共产党北京大学医学部第十三次党员代表大会召开? 三北大深入学习贯彻全国高校思想政治工作会议精神。2月22日，北京大学召开 学习贯彻全国高校思想政治工作会议精神和中央31号文件精神动员会。此后举 办了5场思想政治工作交流会、与中央党校举办学习贯彻全国高校思想政治工作 会议精神专题培训班等活动，召开了全校思想政治工作会议。北大举行学习贯彻 全国高校思想政治工作会议精神和中央31号文件精神工作动员会北京大学推进 贯彻落实习近平总书记讲话和全国高校思政工作会议相关精神工作交流座谈会举 行（第一场）一、北大深入学习宣传贯彻落实党的十九大精 神。10月18-24日，中共十九大召开，北大党委书记郝平当选中央候补委员。北大举办了“十九大与社会主义现代化国家”理论研讨会等活动，学习贯彻十九 大精神。中央宣讲团进入北大宣讲，北大教师、博士生参与教育部、北京市的十 九大宣讲团深入基层宣传十九大精神。“十九大与社会主义现代化国家”理论研 讨会现场北大党委书记郝平当选为中国共产党第十九届中央委员会候补委员北京 大学召开“十九大与社会主义现代化国家”理论研讨会?中央宣讲团赴京大学宣讲 党的十九大精神?二、北大成功召开第十三次党代会。第十三次党代会于11月 18-19日召开，选举产生了中共北京大学第十三届委员会和中共北京大学第十三 届纪律检查委员会，通过了关于中共北京大学第十二届委员会工作报告的决议。 第十三次党代会开启了北大新时代建设中国特色世界一流大学的新征程。此前， 北大医学部于11月3日召开第十三次党代会。北京大学第十三次党代会开幕会现 场中国共产党北京大学第十三次党员代表大会开幕中国共产党北京大学第十三次 党员代表大会胜利闭幕中国共产党北京大学医学部第十三次党员代表大会召开? 三北大深入学习贯彻全国高校思想政治工作会议精神。2月22日，北京大学召开 学习贯彻全国高校思想政治工作会议精神和中央31号文件精神动员会。此后举 办了5场思想政治工作交流会、与中央党校举办学习贯彻全国高校思想政治工作 会议精神专题培训班等活动，召开了全校思想政治工作会议。北大举行学习贯彻 全国高校思想政治工作会议精神和中央31号文件精神工作动员会北京大学推进 贯彻落实习近平总书记讲话和全国高校思政工作会议相关精神工作交流座谈会举 行（第一场）一、北大深入学习宣传贯彻落实党的十九大精 神。10月18-24日，中共十九大召开，北大党委书记郝平当选中央候补委员。北大举办了“十九大与社会主义现代化国家”理论研讨会等活动，学习贯彻十九 大精神。中央宣讲团进入北大宣讲，北大教师、博士生参与教育部、北京市的十 九大宣讲团深入基层宣传十九大精神。“十九大与社会主义现代化国家”理论研 讨会现场北大党委书记郝平当选为中国共产党第十九届中央委员会候补委员北京 大学召开“十九大与社会主义现代化国家”理论研讨会?中央宣讲团赴京大学宣讲 党的十九大精神?二、北大成功召开第十三次党代会。第十三次党代会于11月 18-19日召开，选举产生了中共北京大学第十三届委员会和中共北京大学第十三 届纪律检查委员会，通过了关于中共北京大学第十二届委员会工作报告的决议。 第十三次党代会开启了北大新时代建设中国特色世界一流大学的新征程。此前， 北大医学部于11月3日召开第十三次党代会。北京大学第十三次党代会开幕会现 场中国共产党北京大学第十三次党员代表大会开幕中国共产党北京大学第十三次 党员代表大会胜利闭幕中国共产党北京大学医学部第十三次党员代表大会召开? 三北大深入学习贯彻全国高校思想政治工作会议精神。2月22日，北京大学召开 学习贯彻全国高校思想政治工作会议精神和中央31号文件精神动员会。此后举 办了5场思想政治工作交流会、与中央党校举办学习贯彻全国高校思想政治工作 会议精神专题培训班等活动，召开了全校思想政治工作会议。北大举行学习贯彻 全国高校思想政治工作会议精神和中央31号文件精神工作动员会北京大学推进 贯彻落实习近平总书记讲话和全国高校思政工作会议相关精神工作交流座谈会举 行（第一场）一、北大深入学习宣传贯彻落实党的十九大精 神。10月18-24日，中共十九大召开，北大党委书记郝平当选中央候补委员。北大举办了“十九大与社会主义现代化国家”理论研讨会等活动，学习贯彻十九 大精神。中央宣讲团进入北大宣讲，北大教师、博士生参与教育部、北京市的十 九大宣讲团深入基层宣传十九大精神。“十九大与社会主义现代化国家”理论研 讨会现场北大党委书记郝平当选为中国共产党第十九届中央委员会候补委员北京 大学召开“十九大与社会主义现代化国家”理论研讨会?中央宣讲团赴京大学宣讲 党的十九大精神?二、北大成功召开第十三次党代会。第十三次党代会于11月 18-19日召开，选举产生了中共北京大学第十三届委员会和中共北京大学第十三 届纪律检查委员会，通过了关于中共北京大学第十二届委员会工作报告的决议。 第十三次党代会开启了北大新时代建设中国特色世界一流大学的新征程。此前， 北大医学部于11月3日召开第十三次党代会。北京大学第十三次党代会开幕会现 场中国共产党北京大学第十三次党员代表大会开幕中国共产党北京大学第十三次 党员代表大会胜利闭幕中国共产党北京大学医学部第十三次党员代表大会召开? 三北大深入学习贯彻全国高校思想政治工作会议精神。2月22日，北京大学召开 学习贯彻全国高校思想政治工作会议精神和中央31号文件精神动员会。此后举 办了5场思想政治工作交流会、与中央党校举办学习贯彻全国高校思想政治工作 会议精神专题培训班等活动，召开了全校思想政治工作会议。北大举行学习贯彻 全国高校思想政治工作会议精神和中央31号文件精神工作动员会北京大学推进 贯彻落实习近平总书记讲话和全国高校思政工作会议相关精神工作交流座谈会举 行（第一场）"
      }),
      message: "",
      words: []
    };
  },
  methods: {
    handleShow(row, index) {
      //console.log(row, index);
      this.message = this.sample_data[index];
      //console.log(this.message.words)
      this.dialogVisible = true;
      this.words = this.message.words;
    }
  }
};
</script>
